{
    "item": [
        {
            "description": "Netflix is testing a crackdown on password sharing, which could be a 'net positive in the long term,' according to one analyst",
            "guid": "77f514be-858c-45fe-b3a9-2ee5e0d9835f",
            "link": "https://finance.yahoo.com/news/netflix-cracking-down-on-password-sharing-could-be-a-net-positive-in-the-long-term-says-analyst-140425567.html?.tsrc=rss",
            "pubDate": "Sat, 13 Mar 2021 14:04:25 +0000",
            "title": "Analyst: Netflix password sharing 'fairly meaningful,' but a crackdown could work"
        },
        {
            "description": "'The Code Breaker' author and former CNN CEO Walter Isaacson joined Influencers with Andy Serwer to talk about his latest book and he also gave his take on the current state of Apple since the passing of its founder Steve Jobs.",
            "guid": "fbb8180e-a083-3f06-8eab-cd2c81d2a0ba",
            "link": "https://finance.yahoo.com/video/walter-isaacson-targeted-advertising-very-130000204.html?.tsrc=rss",
            "pubDate": "Sat, 13 Mar 2021 13:00:00 +0000",
            "title": "Walter Isaacson: Targeted advertising 'very dangerous' to politics and advocacy"
        },
        {
            "description": "Apple (NASDAQ: AAPL) and Microsoft (NASDAQ: MSFT) have fought each other for market share since the late 1970s.  Apple has amassed the world's largest market cap of around $2 trillion, while Microsoft has the second-largest market cap at $1.8 trillion.  Apple holds $195.6 billion in cash on hand, offset by $112 billion in various forms of debt.",
            "guid": "071c3c2b-a2b2-3f70-a280-fe29f07ea384",
            "link": "https://finance.yahoo.com/m/071c3c2b-a2b2-3f70-a280-fe29f07ea384/better-buy%3A-apple-vs..html?.tsrc=rss",
            "pubDate": "Sat, 13 Mar 2021 12:34:00 +0000",
            "title": "Better Buy: Apple vs. Microsoft"
        },
        {
            "description": "For investors who have owned stocks for only a little while, the broad pullback in tech stocks can be unsettling, and may even cause panic.  On a Fool Live episode recorded on March 3, Fool contributors Matt Frankel and Brian Withers discuss what you should do when the market is going crazy.  Matthew Frankel: I wanted to hit this question from Hunter before we moved on because it really pertains to this whole discussion.",
            "guid": "cafeff64-de50-3661-a901-e59f51dbe9a0",
            "link": "https://finance.yahoo.com/m/cafeff64-de50-3661-a901-e59f51dbe9a0/should-tech-investors-be.html?.tsrc=rss",
            "pubDate": "Sat, 13 Mar 2021 12:07:00 +0000",
            "title": "Should Tech Investors Be Panicking Right Now?"
        },
        {
            "description": "Norway’s central bank, home of the world’s largest sovereign-wealth fund, disclosed the moves in a filing with the Securities and Exchange Commission.",
            "guid": "3f6fdef4-7a49-33c4-818a-531823ae0024",
            "link": "https://finance.yahoo.com/m/3f6fdef4-7a49-33c4-818a-531823ae0024/one-bank-made-big-bets-on.html?.tsrc=rss",
            "pubDate": "Sat, 13 Mar 2021 12:00:00 +0000",
            "title": "One Bank Made Big Bets on Apple, Tesla, Nio, and Other EV Stocks"
        },
        {
            "description": "We asked three experienced investors what they're buying if equities plunge. Growth stocks were definitely on their minds.",
            "guid": "d68bdc77-6c35-3b63-be6b-58ef3572cae5",
            "link": "https://finance.yahoo.com/m/d68bdc77-6c35-3b63-be6b-58ef3572cae5/3-stocks-we%27re-buying-if-the.html?.tsrc=rss",
            "pubDate": "Sat, 13 Mar 2021 11:36:00 +0000",
            "title": "3 Stocks We're Buying if the Market Crashes"
        },
        {
            "description": "(Bloomberg) -- Google failed to kill a lawsuit alleging that it secretly scoops up troves of internet data even if users browse in “Incognito” mode to keep their search activity private.The consumers who filed the case as a class action alleged that even when even they turn off data collection in Chrome, other Google tools used by websites end up amassing their personal information. A federal judge on Friday denied the Alphabet Inc. unit’s initial request to throw out the case.“The court concludes that Google did not notify users that Google engages in the alleged data collection while the user is in private browsing mode,” U.S. District Judge Lucy Koh in San Jose, California, wrote in her ruling.The ruling comes as Google and Apple Inc. face intense scrutiny by lawmakers over their data gathering practices. Google has said it will next year eliminate third-party cookies that help advertisers keep tabs on consumers’ web activity and won’t employ alternative methods to track individuals.Read more: Google Sued for Secretly Amassing Vast Trove of User DataThree Google users filed a complaint in June claiming the company carries on a “pervasive data tracking business.” Google collects browsing history and other web activity data even after users employ safeguards to protect their data such as using “Incognito” private browsing mode, according to the complaint.“Google knows who your friends are, what your hobbies are, what you like to eat, what movies you watch, where and when you like to shop, what your favorite vacation destinations are, what your favorite color is, and even the most intimate and potentially embarrassing things you browse on the internet -- regardless of whether you follow Google’s advice to keep your activities ‘private,’” according to the complaint.Google argued the plaintiffs consented to its privacy policy, which the company said explicitly discloses its data collection practices.“Google also makes clear that ‘Incognito’ does not mean ‘invisible,’ and that the user’s activity during that session may be visible to websites they visit, and any third-party analytics or ads services the visited websites use,” Google said in a court filing.Google had no immediate comment on the ruling.The case is Brown v. Google LLC, 20-3664, U.S. District Court, Northern District of California (San Jose).(Updates with excerpt from ruling.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2021 Bloomberg L.P.",
            "guid": "4beeddf9-dd39-3518-b5e9-750e38dbf452",
            "link": "https://finance.yahoo.com/news/google-must-face-suit-over-071531229.html?.tsrc=rss",
            "pubDate": "Sat, 13 Mar 2021 07:15:31 +0000",
            "title": "Google Must Face Suit Over Snooping on ‘Incognito’ Browsing"
        },
        {
            "description": "The show starts with Fool.com contributor Matt Frankel, CFP, interviewing Luke Schoenfelder, CEO of property technology company Latch, which recently announced plans to go public via TS Innovation Acquisition (NASDAQ: TSIA).  Then, Matt and host Jason Moser take a closer look at two other blank-check companies on their radar.  To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center.",
            "guid": "b40a311b-d23d-386e-a83f-c49330bd15c5",
            "link": "https://finance.yahoo.com/m/b40a311b-d23d-386e-a83f-c49330bd15c5/spac-watch%3A-an-interview-with.html?.tsrc=rss",
            "pubDate": "Sat, 13 Mar 2021 03:57:52 +0000",
            "title": "SPAC Watch: An Interview With Latch's CEO, Plus 2 Debuts We're Watching"
        },
        {
            "description": "Buying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the best Robinhood stocks to buy now.",
            "guid": "013f3a26-06d7-3bb6-8811-ddbc901f9eec",
            "link": "https://finance.yahoo.com/m/013f3a26-06d7-3bb6-8811-ddbc901f9eec/these-are-the-best-robinhood.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 23:02:14 +0000",
            "title": "These Are The Best Robinhood Stocks To Buy Or Watch Now"
        },
        {
            "description": "Apple (AAPL) closed the most recent trading day at $121.05, moving -0.75% from the previous trading session.",
            "guid": "6bc63689-9773-325a-ba8e-d391bde4c821",
            "link": "https://finance.yahoo.com/news/apple-aapl-stock-sinks-market-224510172.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 22:45:10 +0000",
            "title": "Apple (AAPL) Stock Sinks As Market Gains: What You Should Know"
        },
        {
            "description": "It’s been a long, tough road for value investors, who have lagged behind the market for a decade. But 2021 has seen a resurgence of value. Here’s why these fund managers say it will continue.",
            "guid": "a85d6a08-b175-374a-8535-f9e449e2867c",
            "link": "https://finance.yahoo.com/m/a85d6a08-b175-374a-8535-f9e449e2867c/how-to-play-the-valuation-gap.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 22:45:00 +0000",
            "title": "How to Play the Valuation Gap Between Growth and Value Stocks"
        },
        {
            "description": "Walter Isaacson says Apple is more of a force of good than the likes of Facebook, which allows for the spread of misinformation and anger.",
            "guid": "e4bfe382-a307-409c-93b6-965ba99d5361",
            "link": "https://finance.yahoo.com/news/walter-isaacon-apple-is-a-force-for-good-facebook-not-so-much-202003385.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 20:20:03 +0000",
            "title": "Apple is ‘a force for good,’ Facebook not so much: Walter Isaacson"
        },
        {
            "description": "Apple has been an American success story several times over with the Mac, iPod, iPhone and other inventions. But is Apple stock a buy now? Here's what its stock chart and earnings show.",
            "guid": "7c66194e-24f9-3ffe-bb29-a4dea96f7065",
            "link": "https://finance.yahoo.com/m/7c66194e-24f9-3ffe-bb29-a4dea96f7065/is-apple-stock-a-buy-ahead-of.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 19:50:30 +0000",
            "title": "Is Apple Stock A Buy Ahead Of Possible Spring Product Launch Event?"
        },
        {
            "description": "The Nasdaq sold off as the 10-year Treasury yield spiked. The Dow Jones continued to rally, however. A Warren Buffett stock dipped.",
            "guid": "b0b0a479-b682-38ec-87b8-cbe70fb9dc71",
            "link": "https://finance.yahoo.com/m/b0b0a479-b682-38ec-87b8-cbe70fb9dc71/nasdaq-slips-as-biden.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 18:45:22 +0000",
            "title": "Nasdaq Slips As Biden Stimulus Raises These Fears; Dow Rallies; Warren Buffett Stock Crumbles"
        },
        {
            "description": "T-Mobile CEO Mike Sievert chats with Yahoo Finance after one intense week in the telecom space.",
            "guid": "68bb68fc-ab42-4c50-af1c-0c8bc0bec886",
            "link": "https://finance.yahoo.com/news/t-mobile-ceo-our-goal-is-to-offer-the-best-network-experience-and-the-best-value-183234205.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 18:32:34 +0000",
            "title": "T-Mobile CEO: Our goal is to 'offer the best network experience and the best value'"
        },
        {
            "description": "Same same but different — we help you decide",
            "guid": "7858581e-e0a2-3bc3-809c-b0dfaaa51af9",
            "link": "https://uk.finance.yahoo.com/news/airpods-max-vs-airpods-pro-175734316.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 17:57:34 +0000",
            "title": "AirPods Max vs AirPods Pro: Should you buy Apple’s earbuds or headphones?"
        },
        {
            "description": "Apple stock has lagged behind the broader market in recent weeks on speculation about iPhone production cuts. One analyst says it offers a good buying opportunity.",
            "guid": "ef4a1220-a46d-3a6e-964f-454fa9cd73a0",
            "link": "https://finance.yahoo.com/m/ef4a1220-a46d-3a6e-964f-454fa9cd73a0/apple-has-slumped.-why-morgan.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 17:41:00 +0000",
            "title": "Apple Has Slumped. Why Morgan Stanley Says to Buy the Stock and Ignore the Noise."
        },
        {
            "description": "Citi's Jim Suva thinks it's just a matter of time before the tech giant enters the automotive business.",
            "guid": "8e47683d-1bc1-3e48-a3fc-9a56ef0bcc1d",
            "link": "https://finance.yahoo.com/m/8e47683d-1bc1-3e48-a3fc-9a56ef0bcc1d/apple%E2%80%99s-market-cap-could.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 17:25:00 +0000",
            "title": "Apple’s Market Cap Could Reach $3 Trillion If It Starts Making Cars, Analyst Says"
        },
        {
            "description": "The Dow Jones Industrial Average rose but the Nasdaq slumped as bond yields jumped, sending tech stocks lower while cyclicals and financials outperformed.",
            "guid": "ba9b3a75-2324-39bd-8299-0e4a2ba85341",
            "link": "https://finance.yahoo.com/m/ba9b3a75-2324-39bd-8299-0e4a2ba85341/dow-jones-hits-record-high-as.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 17:12:48 +0000",
            "title": "Dow Jones Hits Record High As Nasdaq Gets Slammed; Bond Yields Jump"
        },
        {
            "description": "The Zacks Analyst Blog Highlights: Apple, Google, Amazon and Gramin",
            "guid": "a29a4d68-a10d-3f30-b6bb-e99c92150340",
            "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-apple-150903219.html?.tsrc=rss",
            "pubDate": "Fri, 12 Mar 2021 15:09:03 +0000",
            "title": "The Zacks Analyst Blog Highlights: Apple, Google, Amazon and Gramin"
        }
    ],
    "language": "en-US",
    "lastBuildDate": "Sat, 13 Mar 2021 16:54:40 +0000"
}