{
    "item": [
        {
            "description": "As the market fights a pullback, it's time to stress test your portfolio. Apple and Nio flashed sell signals. Roku rose on earnings.",
            "guid": "9dea9fb8-6875-31fc-b950-71bddfa2b359",
            "link": "https://finance.yahoo.com/m/9dea9fb8-6875-31fc-b950-71bddfa2b359/dow-jones-futures%3A-stress.html?.tsrc=rss",
            "pubDate": "Fri, 19 Feb 2021 03:52:03 +0000",
            "title": "Dow Jones Futures: Stress Test Your Portfolio; Apple, Nio Flash Sell Signals; Roku Leads Earnings Movers"
        },
        {
            "description": "Ladies and gentlemen, thank you for standing by and welcome to the Fourth Quarter 2020 Universal Electronics Inc. Earnings Conference Call.  Thank you, Jonathan, and thank you all for joining us for the Universal Electronics' fourth quarter and year-end 2020 financial results conference call.  Any additional updated material non-public information that might be discussed during this call will be provided on the Company's website where it will be retained for at least one year.",
            "guid": "32fd662a-ca7a-3c1e-aacc-945abec3ba9a",
            "link": "https://finance.yahoo.com/m/32fd662a-ca7a-3c1e-aacc-945abec3ba9a/universal-electronics-inc.html?.tsrc=rss",
            "pubDate": "Fri, 19 Feb 2021 00:30:55 +0000",
            "title": "Universal Electronics Inc (UEIC) Q4 2020 Earnings Call Transcript"
        },
        {
            "description": "Buying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the best Robinhood stocks to buy now.",
            "guid": "013f3a26-06d7-3bb6-8811-ddbc901f9eec",
            "link": "https://finance.yahoo.com/m/013f3a26-06d7-3bb6-8811-ddbc901f9eec/these-are-the-best-robinhood.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 22:50:14 +0000",
            "title": "These Are The Best Robinhood Stocks To Buy Or Watch Now"
        },
        {
            "description": "Big Tech is about to be flambéed on Capitol Hill yet again. The House Judiciary Subcommittee on Antitrust, Commercial, and Administrative Law said Thursday it plans to hold a series of hearings starting next week to \"consider legislative proposals to address the rise and abuse of market power online and to modernize the antitrust laws.\" The first hearing, \"Reviving Competition, Part 1: Proposals to Address Gatekeeper Power and Lower Barriers to Entry Online,\" is scheduled Feb. 25. The hearings are intended to build on the committee's 16-month investigation into competition online, with particular emphasis on the business practices of Google parent Alphabet Inc. , Facebook Inc. , Amazon.com Inc. , and Apple Inc. . Earlier, the House Energy and Commerce Committee announced that Facebook Chief Executive Mark Zuckerberg, Google CEO Sundar Pichai, and Twitter Inc. CEO Jack Dorsey will testify in a March 25 hearing on misinformation online.",
            "guid": "c2528602-5d46-3ac0-88ac-13ee4e5abaec",
            "link": "https://finance.yahoo.com/m/c2528602-5d46-3ac0-88ac-13ee4e5abaec/congress-gets-ready-to-grill.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 22:39:00 +0000",
            "title": "Congress gets ready to grill Big Tech with a series of hearings starting next week"
        },
        {
            "description": "(Bloomberg) -- The chief executives of Facebook Inc., Alphabet Inc.’s Google and Twitter Inc. are set to testify in Washington next month as Congress gears up for a new round of scrutiny of giant technology companies.Two separate House committees on Thursday announced plans to examine the power of the major tech platforms. The three executives will testify in March, while a House antitrust panel announced hearings to consider legislation that could curb the companies’ dominance.Facebook CEO Mark Zuckerberg, Alphabet CEO Sundar Pichai and Twitter CEO Jack Dorsey will appear virtually at a March 25 hearing before a House Energy and Commerce joint subcommittee hearing on online misinformation and disinformation.The hearings by the House antitrust panel, which are slated to start next week, stem from a 16-month investigation of the tech industry that determined companies like Google and Amazon.com Inc. are using their power to thwart competition in digital markets.“For too long, the dominance of a handful of gatekeepers online has wreaked havoc on competition, suppressed innovation, and weakened entrepreneurship,” Representative David Cicilline of Rhode Island, who chairs the panel, said in a statement. “I pledged to undertake a series of legislative reforms to restore competition online and to strengthen the antitrust laws. I look forward to working on a bipartisan basis to do just that.”The hearings will kick off Thursday and focus on addressing gatekeeper power and lowering barriers to competition online, according to the committee. Additional hearings will look at modernizing antitrust laws used to police mergers and anticompetitve conduct.A committee spokeswoman said a list of witnesses wasn’t yet available.The House move to examine potential changes to antitrust laws comes as Senator Amy Klobuchar of Minnesota introduced legislation in the Senate to target large mergers and dominant companies.Zuckerberg and Dorsey testified before the Senate Judiciary Committee in November about content moderation and their role in political discourse.At that hearing, the chief executives were hit with Republican complaints that the companies silence conservatives, while Democrats expressed worries about the proliferation of misinformation and hate speech on the platforms. The companies have consistently denied any bias against conservatives or their viewpoints.The CEOs did say that companies should be more transparent about what kinds of posts they remove. Zuckerberg suggested that tech companies should have to meet certain standards for removing content as part of any changes to regulation.Zuckerberg and Pichai also testified before Cicilline’s panel last July, along with Amazon’s Jeff Bezos and Tim Cook of Apple Inc., during a five-hour hearing into their market power.For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2021 Bloomberg L.P.",
            "guid": "b82b4fb4-69db-34c1-b4f2-d18382ba7208",
            "link": "https://finance.yahoo.com/news/zuckerberg-pichai-dorsey-due-back-223003363.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 22:30:03 +0000",
            "title": "Zuckerberg, Pichai, Dorsey Due Back for New Grilling in Congress"
        },
        {
            "description": "The Dow Jones Industrial Average closed lower in today's stock market after a report on the U.S. labor market sharply disappointed.",
            "guid": "f62468e4-3188-3304-a2e3-276251385d8b",
            "link": "https://finance.yahoo.com/m/f62468e4-3188-3304-a2e3-276251385d8b/dow-jones-closes-lower-after.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 21:38:27 +0000",
            "title": "Dow Jones Closes Lower After Jobless Claims Report; GameStop House Hearing Begins"
        },
        {
            "description": "The Dow Jones Industrial Average slid from record highs at the end of January, as the current stock market rally continues. The best Dow Jones stocks to buy and watch in February 2021 are Apple, Microsoft and Nike.",
            "guid": "65b53896-faf4-3a06-9d0d-a63cf3c83192",
            "link": "https://finance.yahoo.com/m/65b53896-faf4-3a06-9d0d-a63cf3c83192/best-dow-jones-stocks-to-buy.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 21:06:33 +0000",
            "title": "Best Dow Jones Stocks To Buy And Watch In February 2021: Apple Sells Off"
        },
        {
            "description": "Apple Inc has added a security feature across its operating systems to battle hacks into its devices that rely on incoming iMessages, it said on Thursday.  Using a sophisticated spying tool called Karma, which relied on a flaw in Apple's iMessage system, they accessed iPhones without requiring the targets to click on anything to establish a connection.  While largely invisible to users, BlastDoor is present on iOS 14, the most recent version of Apple's iPhone operating system, and systems for all its other devices, company officials said.",
            "guid": "aa1b186b-32b3-3763-b5ca-6220a76388fa",
            "link": "https://finance.yahoo.com/news/apple-adds-blastdoor-security-feature-205602517.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 20:56:02 +0000",
            "title": "Apple adds 'BlastDoor' security feature to fight iMessage hacks"
        },
        {
            "description": "Job site Glassdoor now includes employee-provided company ratings and salary reports that are broken out by specific demographic groups such as race/ethnicity, gender identity, parental or caregiver status, disability, sexual orientation, and veteran status. For example, job seekers can now see and compare how Black employees at a company rate their company’s culture or career opportunities compared to white employees at that company, according to Glassdoor.",
            "guid": "e7cbe445-97fd-45c1-baba-86992e23dc24",
            "link": "https://finance.yahoo.com/news/glassdoor-now-categorizes-employee-reviews-by-race-and-gender-205057863.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 20:50:57 +0000",
            "title": "You can now sort company ratings by race, gender identity on Glassdoor"
        },
        {
            "description": "Felix Zulauf retired from the Barron’s Roundtable in 2017 after 30 years’ service, and has given up managing other people’s money.  To the contrary, from his perch in Baar, Switzerland, he continues to follow macroeconomic trends, sharing his invariably thoughtful observations and often-bracing opinions with clients of Zulauf Consulting, a research firm catering to institutional investors.  There’s a lot to observe these days, from China’s muscular rise to Europe’s shaky union, not to mention the global meltdown in bond yields and buildup in public debt.",
            "guid": "1167e173-8eca-3697-87f2-15c92d749cf3",
            "link": "https://finance.yahoo.com/m/1167e173-8eca-3697-87f2-15c92d749cf3/felix-zulauf%E2%80%99s-guide-to.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 20:48:00 +0000",
            "title": "Felix Zulauf’s Guide to ‘Crazy’ Policies, Investment Bargains, and Bitcoin Mania"
        },
        {
            "description": "Big tech companies, including Apple (NASDAQ: AAPL) and Facebook (NASDAQ: FB), are at war over the collection of consumers' personal data.  On this clip from Motley Fool Live, recorded on Feb. 8, \"The Wrap\" host Jason Hall, Fool analyst Auri Hughes, and Fool.com contributor Danny Vena talk about the battle lines being drawn between user privacy and data collection and how it plays out in the future.",
            "guid": "5987c9b6-28db-3ea8-b0c0-cfb9cbe8523c",
            "link": "https://finance.yahoo.com/m/5987c9b6-28db-3ea8-b0c0-cfb9cbe8523c/are-we-entering-the-orwellian.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 19:00:00 +0000",
            "title": "Are We Entering the Orwellian Era of 'Nineteen Eighty-Four?'"
        },
        {
            "description": "The Dow Jones Industrial Average fell 275 points Thursday, as Bitcoin crossed above $52,000. Tesla stock skidded on price cuts.",
            "guid": "b7f3f5d1-7556-3810-b8f0-a46812770f88",
            "link": "https://finance.yahoo.com/m/b7f3f5d1-7556-3810-b8f0-a46812770f88/dow-falls-as-bitcoin-tops.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 18:42:03 +0000",
            "title": "Dow Falls As Bitcoin Tops $52,000; Tesla Cuts Prices, While Walmart Dives On Earnings"
        },
        {
            "description": "Apple Inc (NASDAQ: AAPL) is attempting to start iPad tablet production in India to boost the exports of computer products in the country, Reuters reports. India launched a $6.7 billion plan to boost smartphone exports last year as a part of Prime Minister Narendra Modi’s initiative towards promoting electronics manufacturing and job creation. The Indian government will be introducing incentives to drive local manufacturing of IT products, including tablets, laptops, and servers. India could offer cash-back to export manufacturers with a budget of up to $964.5 million (Rs 70 billion) over five years under its novel performance-linked incentive PLI scheme. Apple and others are pushing for a higher budgetary outlay of $2.75 billion (Rs 200 billion) before that plan is finalized, as India lacks the scale and supply chain for making IT products. New Delhi is contemplating another PLI budget of $688.5 million (Rs 50 billion) over five years to boost domestic manufacturing of wearable devices like smartwatches. The tech giant had ramped up the production of iPhones in India to reduce dependence on China amidst Donald Trump’s trade war against the country. Apple had outsourced the production of iPads to Vietnam and India to mitigate the impact of the trade war and the pandemic. Apple will likely have iPad’s assembled by one of its existing suppliers in India as early as this year which might get delayed amidst entry restrictions for Apple’s Chinese supplier BYD Electronic (International) Co Ltd (OTC: BYDIF). That leaves Apple with Foxconn Technology Co Ltd (OTC: FXCOF), Wistron Corp (OTC: WICOF), Pegatron Corp (OTC: PGTRF), and Compal Electronics Inc (OTC: CMPCY) for India. iPhone supplier Wistron has resumed operations at a southern Indian plant after a protest from angry workers last year. Apple is yet to take the Taiwan manufacturer off the trial. Apple’s three suppliers have committed $900 million over five years towards iPhone production in India. Price action: AAPL shares were down 1.75% at $128.55 on the last check Thursday. Image Courtesy: Wikimedia See more from BenzingaClick here for options trades from BenzingaApple Supplier SiTime Raises 0.5M At 9.5% DiscountFortnite Maker Escalates Apple's Disputed App Store Fee Rules To EU: Reuters© 2021 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.",
            "guid": "e991eed1-65d7-3bc8-b0b3-e3b312140e6f",
            "link": "https://finance.yahoo.com/news/india-entices-apple-incentives-ipad-182019985.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 18:20:19 +0000",
            "title": "India Entices Apple With Incentives For iPad Assembly Plant: Reuters"
        },
        {
            "description": "The move comes at a time when Apple has grown warmer to granting access to its services to hardware devices outside its ecosystem, with Chromecast users getting access to its renowned originals like \"The Morning Show\" and \"Greyhound\".  Apple in 2019 had made its TV app available on Amazon.com Inc's Fire TV devices and Roku Inc's platform.",
            "guid": "8c71e073-8bc6-3e67-9a03-4935f603d12c",
            "link": "https://finance.yahoo.com/news/google-adds-apples-tv-app-181157390.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 18:11:57 +0000",
            "title": "Google adds Apple's TV app to latest Chromecast device"
        },
        {
            "description": "Plugging a notable gap in its streaming lineup, Google has added the Apple TV app — the only way to get the Apple TV Plus service — to its newest Chromecast device. Starting Thursday, users with the $50 Chromecast with Google TV adapter will be able to access Apple TV. In addition, the Apple TV […]",
            "guid": "4f06cdd9-0779-3acc-bae8-44f9239d0ea2",
            "link": "https://finance.yahoo.com/news/apple-tv-app-now-available-170022026.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 17:00:22 +0000",
            "title": "Apple TV App Is Now Available on Chromecast With Google TV"
        },
        {
            "description": "Fortnite developer Epic Games escalated its battle with Apple (NASDAQ: AAPL) by filing an antitrust complaint in the European Union (EU) over the fees Apple takes for in-app purchases made from apps downloaded from its App Store.  Although the two will face off in court in May, Epic is making its war on Apple's payment system a global affair, having filed similar lawsuits against it in the U.S., Australia, and the U.K.  Last summer, Epic Games bypassed Apple's fees by allowing Fortnite players to pay the developer directly for any in-app purchases.",
            "guid": "cee14e12-fcc4-3ef0-bdbd-e8aef78e0c3d",
            "link": "https://finance.yahoo.com/m/cee14e12-fcc4-3ef0-bdbd-e8aef78e0c3d/fortnite-maker-epic-games.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 15:42:00 +0000",
            "title": "Fortnite Maker Epic Games Files Antitrust Lawsuit Against Apple in the EU"
        },
        {
            "description": "Apple Inc. is interested in participating in a new scheme to boost India’s exports of computer products, part of what government and industry sources say are plans to bring iPad tablet production to the South Asian country, Reuters has learnt. According to the Reuters report, the Indian government is working on a plan to offer a new performance-linked incentive scheme to drive local manufacturing of IT products including tablets, servers, and laptops. Apple (AAPL) is lobbying for a higher budget outlay of 200 billion rupees before the new incentive plan is finalized, Reuters said. The new performance-linked incentive scheme will have a budget of up to $964.5 million over five years and will offer cash-back to manufacturers for exports. This scheme is expected to be launched by the end of this month. Apple has been steadily increasing its production of iPhones in India to reduce the company’s dependence on Chinese manufacturers, according to Reuters. Last year, India had launched a plan worth $6.7 billion to boost smartphone exports and Apple had participated in the scheme through its contract manufacturers, the report said. Meanwhile, Apple’s most recent 1Q earnings saw its largest revenues in a single quarter, exceeding the $100 billion milestone for the first time, driven by strong sales in every product category, especially 5G iPhone sales. The company’s iPad revenues soared 41% to $8.44 billion year-over-year and exceeded analysts’ estimates of $7.46 billion. (See Apple stock analysis on TipRanks) On Feb. 16, Raymond James analyst Chris Caso reiterated a Buy rating on the stock. Caso stated, “…our analysis demonstrates that iPhone units have run a cumulative 55 million units below a 215 million unit trendline in FY19 and FY20, thereby creating an opportunity for mean reversion as the installed base ages.” “And we see a reason for that installed base to upgrade, with better global 5G penetration later this year, and improved phone features, such as the return of fingerprint sensing. Net, if we assume that mean reversion allows a return to a prior peak iPhone unit number of 231 million units at current ASPs [average selling price], that would drive FY22 iPhone revenue over $200 billion, or 10% in excess of current expectations,” Caso added. The rest of the Street is cautiously optimistic about the stock with a Moderate Buy consensus rating. That’s based on 19 analysts recommending a Buy, 5 analysts suggesting a Hold, and 2 analysts recommending a Sell. The average analyst price target of $149.70 implies 14.4% upside potential to current levels. Related News: Tilray Jumps 11% Pre-Market As 4Q Loss Narrows; Street Says Hold Sleep Number Spikes 13% After Blowout Quarter; Street Says Hold Facebook Blocks News Feed For Users In Australia – Report More recent articles from Smarter Analyst: Rigel Partners With Eli Lilly On Therapy For Autoimmune Disorders; Stock Pops 15% Nokia Nabs 5G Multi-Year Contract With A1 Austria Pegasystems Provides Upbeat 2021 Guidance After 4Q Lags Analysts’ Estimates Pan American Tops 4Q Profit Amid Silver Price Rally; Street Sees 17% Upside",
            "guid": "661319fa-562b-3c6e-b8ec-48bbc1147036",
            "link": "https://finance.yahoo.com/news/apple-pushes-india-scheme-amid-152404272.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 15:24:04 +0000",
            "title": "Apple Pushes For India Scheme Amid Plan For iPad Production – Report"
        },
        {
            "description": "It’s been a tough week for some of the world’s largest stocks. Apple Inc (NASDAQ: AAPL) and Tesla Inc (NASDAQ: TSLA) keep losing ground (see more below), and now Walmart Inc (NYSE: WMT) joins them as investors register disappointment with the company’s earnings and outlook. Shares fell 5% in pre-market trading after WMT missed Wall Street’s earnings per share projection and forecast tepid fiscal 2022 growth. There was a lot to like about WMT’s quarter, including sales that surpassed expectations and rose 7.3% from a year ago to top $152 billion. Analysts had expected around $148 billion. U.S. same-store sales did even better, and U.S. e-commerce sales rolled up 69% gains. However, the company’s $1.39 a share in earnings came up 12 cents short of the Wall Street average $1.51 estimate, hurt by WMT’s decision to repay property tax relief in the U.K. that cost it 7 cents a share on the bottom line. WMT’s investment in supply chain and automation will probably be under a microscope the rest of year to see if investment panned out to continued growth. Digital advertising, health care, and web marketplaces are higher margin businesses than WMT’s core business. They will be spending more on investment, and that will go toward trying to help the digital side of their business. Consider listening on the conference call to monitor for details on how profitable the e-commerce business has been because it actually doesn’t make money yet. A big piece of the dip in WMT shares this morning was its outlook. WMT sees FY 2022 sales rising in the low single digits, with operating income and earnings flat to up slightly. WMT shares are up nearly 24% over the last year, ahead of the S&P 500 Index (SPX). This morning, at least, it looks like investors are dialing some of that back as they contemplate what looks like a pretty sluggish earnings picture ahead. One other interesting note before we leave the WMT discussion: The company said it plans to raise its U.S. associate wages to an average of above $15 an hour. This could influence the debate around the minimum wage in Washington, where some in Congress want to raise the national minimum to $15 as part of the fiscal stimulus bill. We’ll see if those who want to raise it start to cite WMT’s move in their talking points. Washington View: GameStop Hearing Up Next After WMT, attention today could veer toward Capitol Hill, where a hearing on the GameStop Corp. (NYSE: GME) stock controversy from last month will feature testimony from company leaders and investors involved in January’s stock market volatility. This is likely to be watched by the entire industry, from businesses to individual investors, and media reports say participants likely will face grilling from both sides of the aisle. Other things on the calendar include import and export prices, which could be interesting, and this morning’s weekly initial jobless claims number. If people were hoping for some solace there after the disappointing WMT news, they didn’t find any. New claims rose to 861,000 in the latest week. That was way above the Wall Street consensus for 775,000, and up from an upwardly revised 848,000 the prior week. Stock index futures—already under pressure from WMT—extended losses after the jobless claims data. Speaking of which, when you look at next week’s initial claims, they may appear lower than expected because it’s doubtful many people were able to file in Texas with the weather there this week. So a positive reading next Thursday might not tell the whole story. Looking back at yesterday, the market basically pulled a pretty big head fake, recovering from early losses. It shows that it doesn’t make sense to panic when you see the market pull back, and instead you might chalk up sudden moves to the continued choppy pattern we’ve been witnessing. Part of this week’s choppiness reflects that there’s a lot of economic data and earnings to digest, and Wednesday was particularly heavy with retail sales, producer prices, and Fed minutes. There’s also continued progress on the stimulus package, which is helping raise yields in the bond market. Another thing to keep an eye on is the power outage situation in Texas. If it’s a short-term thing, the effect probably will be minimal. But if it continues, there could be a lasting impact on businesses, like you often see with hurricanes. Sometimes these types of weather events can hurt retail sales and even take a bite out of quarterly gross domestic product, though it’s too early to say if that’s going to happen. Yield Surge Clips Tech Market The Info Tech sector posted the worst results of all S&P 500 sectors yesterday, plagued in part by rising Treasury yields. Strong readings on January retail sales and the producer price index released early Wednesday gave the yield rally another lift, and higher rates are often considered a weight on Tech and other growth stocks. Remember back in late 2018 how the Tech market took a pounding after yields reached multi-year highs. We’re nowhere near those levels now, which topped 3% for the 10-year Treasury yield back then. The current yield near 1.29%—down a few ticks this morning after the weak claims data—would have been an all-time low before last year, but it’s the momentum of its climb that may be causing worries for growth stock investors. It’s gone up around 40 basis points since the start of this year, a pace you don’t often see in this particular market. One way to look at that could be that there’s never been a time quite like this, with the economy emerging from a self-induced (well, pandemic-induced) recession. It wasn’t a normal recession where demand began to flag or the financial markets got out of whack. Instead, we brought it on ourselves by shutting down the world economy. That, followed by central banks around the world immediately dropping rates to zero and scooping up bonds to push yields down, caused the record low interest rates. Now if the pandemic truly is starting to retreat, it’s hard to find natural reasons for rates to be this low (aside from the fact that unemployment remains a major problem in the wake of the recession and may not be able to claw back as quickly as the overall economy). On the other hand, the Fed has said it has no plans to stop its $120 billion a month bond purchase program anytime soon, and forecasts the next rate rise not in terms of months, but years. This could ultimately put a brake on the yield rally, but we’ll have to wait and see. Gold Keeps Struggling Despite Inflation Concerns Let’s go from stocks that trade for pennies to a commodity that commands over $1,700 for just an ounce. We’ve talked about the “risk-on” mood playing a bigger role lately, something you can see in the relatively weak dollar (which continues to scratch along near three-year lows), and falling bond values. Another possible sign of this could be what’s going on in the gold market. Gold has fallen four days in a row, and on Wednesday it carved a “death cross” on the charts (see chart below). That’s where the 50-day moving average falls below the 200-day moving average, and analysts say it can often point to more weakness ahead. It’s a little bit odd to see gold taking a dive right even while the U.S. Congress looks like it’s getting closer to passing a huge stimulus bill that some analysts worry could drive up inflation. You’d think that with inflation becoming more of a concern (also possibly evident in the recent rise of Treasury yields), gold might be getting a bit more of an embrace from investors. Some analysts think that’s not out of the question. That would be good news for people holding shares of mining companies like Barrick Gold Corp (NYSE: GOLD) and Newmont Corporation (NYSE: NEM), which have been in a slump lately. Still, it’s been a rough few months for gold lovers who saw the precious metal rise above $2,000 an ounce last year for the first time. Gold recently traded at $1,772, down nearly $300 from last year’s highs. CHART OF THE DAY: GOLD’S “DEATH CROSS.” Gold (/GC—candlestick) has been falling pretty steadily from its recent highs, and has now painted a “death cross” on the charts. That’s when the 50-day moving average (blue line) falls below the 200-day moving average (red line). It’s usually considered technically bearish. Data source: CME Group. Chart source: The thinkorswim® platform from TD Ameritrade. For illustrative purposes only. Past performance does not guarantee future results. Oh Where Oh Where? The market often resembled a game of follow-the-leader the last year or two, but two of its leaders appear to be missing in action. Apple Inc (NASDAQ: AAPL) and Tesla Inc (NASDAQ: TSLA), which both split their stocks last summer and generated loads of enthusiasm among investors, are spinning their wheels so far this month. AAPL, which rose 10% in December and was flat in January, is down about 1.5% for February. TSLA rose 24% in December and 12% in January but is down 2.5% in February and back below $800 a share. Plenty of people will likely pin this on overbought conditions and profit taking, and they might have a point. It’s almost certainly not a reaction to earnings from either company, both of which drew accolades for their recent results. One negative factor could be investor money moving in other directions. First of all, the reopening economy apparently is helping shares of Energy and Financial companies, along with smaller stocks that tend to do best when the U.S. economy improves. The Russell 2000 (RUT) small-cap index has been an early leader this year. Also, alternative investments like bitcoin have been a magnet for many investors, while rising bond yields may be drawing some people toward fixed income. Then things got tougher for AAPL on Wednesday with news that Berkshire Hathaway Inc.’s (NYSE: BRK) Warren Buffett was selling some shares (though it remains a huge holder of AAPL). Whatever the reason, seeing AAPL and TSLA shares losing a little zip isn’t necessarily good for the broader market, which often moves higher on their lead. Instead, their recent lack of leadership may be zapping investor enthusiasm beyond their immediate orbit, while their huge market-caps have an oversized impact on the path of the Nasdaq (COMP). “Oracle of Omaha” Strikes Again: Since we brought up Buffet (above), it’s worth noting that BRK’s stock purchases announced Wednesday veered toward a couple of sectors that until recently hadn’t received much love from investors: Energy and telecom. Verizon Communications Inc. (NYSE: VZN) shares jumped 5% on news of BRK’s move, while Chevron (CVX) climbed 3%. Energy (which got dramatically smacked down by Covid in 2020) has been on a roll lately as reopening optimism picks up, so it’s not too surprising to see BRK taking a position in CVX. But VZN and its competitors T-Mobile Us Inc (NASDAQ: TMUS) and AT&T Inc. (NYSE: T) haven’t exactly been lighting up Wall Street with their performance lately. Maybe Buffett—widely known as a “value” investor—sees an opportunity in this run-down part of the market. A bit of a head-scratcher was BRK’s decision to sell some bank shares, another value sector that’s been gaining ground recently. Should investors follow Buffett’s lead? Well, maybe they were ahead of him. The “value” segments of the broader market have been gaining vs. “growth” stocks lately, a trend we also saw for a couple of months last fall. Generally, however, Buffett’s been right more often than he’s been wrong over the years. Which is why they call him “the Oracle of Omaha,” of course. On Short Squeezes and Hedgers: We saw what happened with GameStop Corp. (NYSE: GME) and AMC Entertainment Holdings Inc (NYSE: AMC)—two short-lived short squeezes that actually inflicted some real fear and pain among some hedge funds and other short sellers—who learned first-hand how far a market can detach from fundamentals during a squeeze. But another apparent target—a handful of silver-backed ETFs—was met with a fresh wave of selling almost immediately after piling in. Why the difference? The silver market is a commodities market, and much of the so-called “short interest” may be the very funds issuing these silver-backed ETFs, according to Goldman Sachs Group Inc (NYSE: GS). In other words, the shorts are what commodities traders call a “commercial hedge.” So no matter how high or low silver goes, the funds holding them have either minimized exposure or no exposure at all (if it’s a 100% hedge). Plus, with the silver-backed ETF market worth only 900 million ounces in a larger 25 billion-ounce physical market, the funds are no more than a rounding error compared to the vast silver market. The lessons? Do your homework before you jump into any trade, even a follow-the-herd momentum trade. There may be no real safety in numbers. And not all short interest is subject to the same squeeze dynamics as a low-liquidity stock. TD Ameritrade® commentary for educational purposes only. Member SIPC. Photo by Fabio Bracht on Unsplash See more from BenzingaClick here for options trades from BenzingaNvidia Makes An Advance In The Data Center Space As It Reports Fiscal Fourth QuarterWalmart Earnings Awaited Tomorrow With Focus Turning Toward Online Sales© 2021 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.",
            "guid": "0916e619-c115-3ca5-ac78-b6b39108b7eb",
            "link": "https://finance.yahoo.com/news/walmart-earnings-come-short-outlook-145838083.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 14:58:38 +0000",
            "title": "Walmart Earnings Come Up Short, With Outlook Also Disappointing Wall Street"
        },
        {
            "description": "Apple is one of the most closely watched companies and stocks out there. It is a leader in its industry and a stock market leader too. Let's take a look at two charts.    In this daily Japanese candlestick chart of AAPL, below, we can see the start of some weakness.",
            "guid": "8075ec15-b465-31e1-ae1b-82b767443399",
            "link": "https://finance.yahoo.com/m/8075ec15-b465-31e1-ae1b-82b767443399/can-apple-suffer-a-near-term.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 14:28:00 +0000",
            "title": "Can Apple Suffer a Near-Term Pullback?"
        },
        {
            "description": "Lumentum (NASDAQ: LITE), which produces optical chips and industrial lasers, is one of Apple's (NASDAQ: AAPL) major suppliers.  Its sales of 3D-sensing chips to Apple accounted for 26% of its revenue last year, while its other major customers include Huawei and Ciena.  Lumentum's fate is tightly tethered to Apple's, but its stock price only rose 8% over the past 12 months as Apple's stock price surged nearly 70%.",
            "guid": "c5ac0261-7034-3bae-b243-97cf140362e8",
            "link": "https://finance.yahoo.com/m/c5ac0261-7034-3bae-b243-97cf140362e8/better-buy%3A-lumentum-vs.-apple.html?.tsrc=rss",
            "pubDate": "Thu, 18 Feb 2021 14:15:00 +0000",
            "title": "Better Buy: Lumentum vs. Apple"
        }
    ],
    "language": "en-US",
    "lastBuildDate": "Fri, 19 Feb 2021 06:47:45 +0000"
}